cask_args appdir: "/Applications"

tap "cirruslabs/cli"
tap "hashicorp/tap"
tap "jetbrains/utils"

brew "cirruslabs/cli/tart"
brew "coreutils"
brew "delve"
brew "direnv"
brew "fd"
brew "fzf"
brew "gh"
brew "git", link: true
brew "git-lfs"
brew "go"
brew "hashicorp/tap/packer"
brew "hermit"
brew "kotlin-lsp"
brew "jenv"
brew "jq"
brew "luarocks"
brew "make", link: true
brew "mint"
brew "neovim"
brew "pipx"
brew "rbenv"
brew "rg"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "xcbeautify"
brew "xcode-build-server"
brew "wakeonlan"
brew "zoxide"

cask "1password-cli"
cask "container"
cask "corretto@21"
cask "karabiner-elements"
cask "keepingyouawake"
cask "iterm2"
cask "mitmproxy"
cask "obsidian"
cask "rectangle"
cask "xcodes"
cask "zulu@17"
