cask_args appdir: "/Applications"

tap "getsentry/xcodebuildmcp"
tap "hashicorp/tap"

brew "atuin"
brew "chafa"
brew "coreutils"
brew "delve"
brew "direnv"
brew "elan-init"
brew "fd"
brew "fzf"
brew "gh"
brew "git", link: true
brew "git-lfs"
brew "hashicorp/tap/packer"
brew "hermit"
brew "JetBrains/utils/kotlin-lsp"
brew "jq"
brew "lazygit"
brew "libyaml"
brew "luarocks"
brew "make", link: true
brew "mint"
brew "mise"
brew "neovim"
brew "pipx"
brew "pre-commit"
brew "ripgrep"
brew "sem-cli"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "vhs"
brew "wakeonlan"
brew "getsentry/xcodebuildmcp/xcodebuildmcp"
brew "zoxide"

cask "1password-cli"
cask "container"
cask "devcleaner"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "keepingyouawake"
cask "iterm2"
cask "mitmproxy"
cask "obsidian"
cask "rectangle"
cask "xcodes-app"
